In [35]:
import pandas as pd

In [13]:
cars_csv = pd.read_csv('./cars.csv', index_col=0)

In [14]:
cars_csv

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JPN           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

#### Slicing and indexing

In [18]:
#series method
cars_csv['cars_per_cap']

US     809
AUS    731
JPN    588
IN      18
RU     200
MOR     70
EG      45
Name: cars_per_cap, dtype: int64

In [24]:
#dataframe method
cars_csv[['cars_per_cap', 'drives_right']]

     cars_per_cap  drives_right
US            809          True
AUS           731         False
JPN           588         False
IN             18         False
RU            200          True
MOR            70          True
EG             45          True

#### accessing with loc

- used for all rows and columns
- for specific rows and columns
- for specific values and data within dataframe

In [38]:
cars_csv.loc['US'] #as series

cars_per_cap              809
country         United States
drives_right             True
Name: US, dtype: object

In [39]:
cars_csv.loc[['US']] #as dataframe

    cars_per_cap        country  drives_right
US           809  United States          True

In [41]:
#for specific row and column
cars_csv.loc[['IN', 'JPN'],['cars_per_cap']]

     cars_per_cap
IN             18
JPN           588

#### accessing with iloc

In [42]:
cars_csv

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JPN           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [44]:
cars_csv.iloc[1] #for series data

cars_per_cap          731
country         Australia
drives_right        False
Name: AUS, dtype: object

In [46]:
cars_csv.iloc[[2,3,4]] #for row accessibility

     cars_per_cap country  drives_right
JPN           588   Japan         False
IN             18   India         False
RU            200  Russia          True

In [48]:
cars_csv.iloc[[1,2,3],[1]] #for row and column accessibility

       country
AUS  Australia
JPN      Japan
IN       India